zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rtc_ex.h
/** @defgroup RTCEx_ActiveTamper_Sel  RTCEx Active Tamper selection Definition
  * @{
  */
#define RTC_ATAMP_1                       0U   /*!< Tamper 1 */
#define RTC_ATAMP_2                       1U   /*!< Tamper 2 */
#define RTC_ATAMP_3                       2U   /*!< Tamper 3 */
#define RTC_ATAMP_4                       3U   /*!< Tamper 4 */
#define RTC_ATAMP_5                       4U   /*!< Tamper 5 */
#define RTC_ATAMP_6                       5U   /*!< Tamper 6 */
#define RTC_ATAMP_7                       6U   /*!< Tamper 7 */
#define RTC_ATAMP_8                       7U   /*!< Tamper 8 */
/**
  * @}
  */


/** @defgroup RTCEx_MonotonicCounter_Instance  RTCEx Monotonic Counter Instance Definition
  * @{
  */
#define RTC_MONOTONIC_COUNTER_1           0U   /*!< Monotonic counter 1 */
/**
  * @}
  */


/** @defgroup RTCEx_Backup_Registers  RTCEx Backup Registers Definition
  * @{
  */
#define RTC_BKP_NUMBER                    RTC_BACKUP_NB
#define RTC_BKP_DR0                       0x00U
#define RTC_BKP_DR1                       0x01U
#define RTC_BKP_DR2                       0x02U
#define RTC_BKP_DR3                       0x03U
#define RTC_BKP_DR4                       0x04U
#define RTC_BKP_DR5                       0x05U
#define RTC_BKP_DR6                       0x06U
#define RTC_BKP_DR7                       0x07U
#define RTC_BKP_DR8                       0x08U
#define RTC_BKP_DR9                       0x09U
#define RTC_BKP_DR10                      0x0AU
#define RTC_BKP_DR11                      0x0BU
#define RTC_BKP_DR12                      0x0CU
#define RTC_BKP_DR13                      0x0DU
#define RTC_BKP_DR14                      0x0EU
#define RTC_BKP_DR15                      0x0FU
#define RTC_BKP_DR16                      0x10U
#define RTC_BKP_DR17                      0x11U
#define RTC_BKP_DR18                      0x12U
#define RTC_BKP_DR19                      0x13U
#define RTC_BKP_DR20                      0x14U
#define RTC_BKP_DR21                      0x15U
#define RTC_BKP_DR22                      0x16U
#define RTC_BKP_DR23                      0x17U
#define RTC_BKP_DR24                      0x18U
#define RTC_BKP_DR25                      0x19U
#define RTC_BKP_DR26                      0x1AU
#define RTC_BKP_DR27                      0x1BU
#define RTC_BKP_DR28                      0x1CU
#define RTC_BKP_DR29                      0x1DU
#define RTC_BKP_DR30                      0x1EU
#define RTC_BKP_DR31                      0x1FU
/**
  * @}
  */


/** @defgroup RTCEx_RTC_Secure_Full  RTCEx Secure Definition
  * @{
  */
#define RTC_SECURE_FULL_YES                  RTC_SECCFGR_SEC                 /*!< RTC full secure */
#define RTC_SECURE_FULL_NO                   0U                              /*!< RTC is not full secure, features can be non-secure. */
/**
  * @}
  */

/** @defgroup RTCEx_Binary_Mode RTC Binary Mode (32-bit free-running counter configuration).
  *           Warning : It Should not be confused with the Binary format @ref RTC_Input_parameter_format_definitions.
  * @{
  */
#define RTC_BINARY_NONE                     0x00000000U      /*!< Free running BCD calendar mode (Binary mode disabled). */
#define RTC_BINARY_ONLY                     RTC_ICSR_BIN_0   /*!< Free running Binary mode (BCD mode disabled) */
#define RTC_BINARY_MIX                      RTC_ICSR_BIN_1   /*!< Free running BCD calendar and Binary modes */
/**
  * @}
  */

/** @defgroup RTCEx_Binary_mix_BCDU If Binary mode is RTC_BINARY_MIX,
  * the BCD calendar second is incremented using the SSR Least Significant Bits.
  * @{
  */
#define RTC_BINARY_MIX_BCDU_0  0x00000000U                   /*!<  The 1s BCD calendar increment is generated each time SS[7:0] = 0 */
#define RTC_BINARY_MIX_BCDU_1  (0x1UL << RTC_ICSR_BCDU_Pos)  /*!<  The 1s BCD calendar increment is generated each time SS[8:0] = 0 */
#define RTC_BINARY_MIX_BCDU_2  (0x2UL << RTC_ICSR_BCDU_Pos)  /*!<  The 1s BCD calendar increment is generated each time SS[9:0] = 0 */
#define RTC_BINARY_MIX_BCDU_3  (0x3UL << RTC_ICSR_BCDU_Pos)  /*!<  The 1s BCD calendar increment is generated each time SS[10:0] = 0 */
#define RTC_BINARY_MIX_BCDU_4  (0x4UL << RTC_ICSR_BCDU_Pos)  /*!<  The 1s BCD calendar increment is generated each time SS[11:0] = 0 */
#define RTC_BINARY_MIX_BCDU_5  (0x5UL << RTC_ICSR_BCDU_Pos)  /*!<  The 1s BCD calendar increment is generated each time SS[12:0] = 0 */
#define RTC_BINARY_MIX_BCDU_6  (0x6UL << RTC_ICSR_BCDU_Pos)  /*!<  The 1s BCD calendar increment is generated each time SS[13:0] = 0 */
#define RTC_BINARY_MIX_BCDU_7  (0x7UL << RTC_ICSR_BCDU_Pos)  /*!<  The 1s BCD calendar increment is generated each time SS[14:0] = 0 */
/**
  * @}
  */

/** @defgroup RTCEx_Alarm_Sub_Seconds_binary_Masks_Definitions RTC Alarm Sub Seconds with binary mode Masks Definitions
  * @{
  */
/*!< All Alarm SS fields are masked.There is no comparison on sub seconds for Alarm */
#define RTC_ALARMSUBSECONDBINMASK_ALL           0x00000000U
/*!< SS[31:1] are don't care in Alarm comparison. Only SS[0] is compared.    */
#define RTC_ALARMSUBSECONDBINMASK_SS31_1        (1UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:2] are don't care in Alarm comparison. Only SS[1:0] are compared  */
#define RTC_ALARMSUBSECONDBINMASK_SS31_2        (2UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:3] are don't care in Alarm comparison. Only SS[2:0] are compared  */
#define RTC_ALARMSUBSECONDBINMASK_SS31_3        (3UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:4] are don't care in Alarm comparison. Only SS[3:0] are compared  */
#define RTC_ALARMSUBSECONDBINMASK_SS31_4        (4UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:5] are don't care in Alarm comparison. Only SS[4:0] are compared  */
#define RTC_ALARMSUBSECONDBINMASK_SS31_5        (5UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:6] are don't care in Alarm comparison. Only SS[5:0] are compared  */
#define RTC_ALARMSUBSECONDBINMASK_SS31_6        (6UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:7] are don't care in Alarm comparison. Only SS[6:0] are compared  */
#define RTC_ALARMSUBSECONDBINMASK_SS31_7        (7UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:8] are don't care in Alarm comparison. Only SS[7:0] are compared  */
#define RTC_ALARMSUBSECONDBINMASK_SS31_8        (8UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:9] are don't care in Alarm comparison. Only SS[8:0] are compared  */
#define RTC_ALARMSUBSECONDBINMASK_SS31_9        (9UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:10] are don't care in Alarm comparison. Only SS[9:0] are compared  */
#define RTC_ALARMSUBSECONDBINMASK_SS31_10      (10UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:11] are don't care in Alarm comparison. Only SS[10:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_11      (11UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:12] are don't care in Alarm comparison.Only SS[11:0] are compared  */
#define RTC_ALARMSUBSECONDBINMASK_SS31_12      (12UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:13] are don't care in Alarm comparison. Only SS[12:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_13      (13UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:14] are don't care in Alarm comparison. Only SS[13:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_14      (14UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:15] are don't care in Alarm  comparison. Only SS[14:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_15      (15UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:16] are don't care in Alarm comparison. Only SS[15:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_16      (16UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:17] are don't care in Alarm comparison. Only SS[16:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_17      (17UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:18] are don't care in Alarm comparison. Only SS[17:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_18      (18UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:19] are don't care in Alarm comparison. Only SS[18:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_19      (19UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:20] are don't care in Alarm comparison. Only SS[19:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_20      (20UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:21] are don't care in Alarm comparison. Only SS[20:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_21      (21UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:22] are don't care in Alarm comparison. Only SS[21:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_22      (22UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:23] are don't care in Alarm comparison. Only SS[22:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_23      (23UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:24] are don't care in Alarm comparison. Only SS[23:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_24      (24UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:25] are don't care in Alarm comparison. Only SS[24:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_25      (25UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:26] are don't care in Alarm  comparison. Only SS[25:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_26      (26UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:27] are don't care in Alarm comparison. Only SS[26:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_27      (27UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:28] are don't care in Alarm comparison. Only SS[27:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_28      (28UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:29] are don't care in Alarm comparison. Only SS[28:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_29      (29UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31:30] are don't care in Alarm comparison. Only SS[29:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_30      (30UL << RTC_ALRMASSR_MASKSS_Pos)
/*!< SS[31] is don't care in Alarm comparison. Only SS[30:0] are compared  */
#define RTC_ALARMSUBSECONDBINMASK_SS31         (31UL << RTC_ALRMASSR_MASKSS_Pos)

#define RTC_ALARMSUBSECONDBINMASK_NONE         (32UL << RTC_ALRMASSR_MASKSS_Pos)
/**
  * @}
  */

/** @defgroup RTCEx_Alarm_Sub_Seconds_binary_Clear_Definitions RTC Alarm Sub Seconds
  *           with binary mode auto clear Definitions
  * @{
  */
/*!<  The synchronous Binary counter (SS[31:0] in RTC_SSR) is free-running. */
#define RTC_ALARMSUBSECONDBIN_AUTOCLR_NO    0UL
/*!<  The synchronous Binary counter (SS[31:0] in RTC_SSR) is running from 0xFFFF FFFF to
RTC_ALRMABINR -> SS[31:0] value and is automatically reloaded with 0xFFFF FFFF whenreaching
RTC_ALRMABINR -> SS[31:0]. */
#define RTC_ALARMSUBSECONDBIN_AUTOCLR_YES   RTC_ALRMASSR_SSCLR
/**
  * @}
  */

/** @defgroup RTCEx_RTC_NonSecure_Features  RTCEx Secure Features Definition
  * @{
  */
#define RTC_SECURE_FEATURE_NONE               0U
#define RTC_SECURE_FEATURE_INIT               RTC_SECCFGR_INITSEC  /*!< Initialization */
#define RTC_SECURE_FEATURE_CAL                RTC_SECCFGR_CALSEC   /*!< Calibration */
#define RTC_SECURE_FEATURE_TS                 RTC_SECCFGR_TSSEC    /*!< Time stamp */
#define RTC_SECURE_FEATURE_WUT                RTC_SECCFGR_WUTSEC   /*!< Wake up timer */
#define RTC_SECURE_FEATURE_ALRA               RTC_SECCFGR_ALRASEC  /*!< Alarm A */
#define RTC_SECURE_FEATURE_ALRB               RTC_SECCFGR_ALRBSEC  /*!< Alarm B */
#define RTC_SECURE_FEATURE_ALL                (RTC_SECCFGR_INITSEC |  RTC_SECCFGR_CALSEC | \
                                               RTC_SECCFGR_TSSEC | RTC_SECCFGR_WUTSEC | \
                                               RTC_SECCFGR_ALRASEC | RTC_SECCFGR_ALRBSEC)
/**
  * @}
  */

/** @defgroup RTCEx_TAMP_Secure_Full  RTCEx TAMP Secure
  * @{
  */
#define TAMP_SECURE_FULL_YES                TAMP_SECCFGR_TAMPSEC /*!< TAMPER is full secure */
#define TAMP_SECURE_FULL_NO                 0U                   /*!< TAMPER is not secure */
/**
  * @}
  */

